[Killed] Binary expression mutation
Domain/CocktailService.cs:16:17
         public Cocktail Mix(string name, out decimal? bestPrice)
         {
             var id = barsProvider.FindCocktailId(name);
-            if (id != null)
+            if (id == null)
             {
                 var prices = barsProvider.FindPrices(id.Value);

[Survived] String mutation
Domain/CocktailService.cs:33:40
                         Size = 0.5,
                         PreparationTime = TimeSpan.FromMinutes(5),
                         TotalTime = TimeSpan.FromMinutes(5),
-                        Instructions = "The same as usual mojito but without alcohol"
+                        Instructions = ""
                     };
                     return cocktail;

[Survived] Binary expression mutation
Domain/CocktailService.cs:44:17
         public decimal? FindBestPrice(string name, decimal? currentPrice)
         {
             var id = barsProvider.FindCocktailId(name);
-            if (id != null || currentPrice == null)
+            if (id != null && currentPrice == null)
             {
                 var prices = barsProvider

[Survived] Binary expression mutation
Domain/CocktailService.cs:44:31
         public decimal? FindBestPrice(string name, decimal? currentPrice)
         {
             var id = barsProvider.FindCocktailId(name);
-            if (id != null || currentPrice == null)
+            if (id != null || currentPrice != null)
             {
                 var prices = barsProvider

[Killed] Binary expression mutation
Domain/CocktailService.cs:47:33
             if (id != null || currentPrice == null)
             {
                 var prices = barsProvider
-                    .FindPrices(id != null ? id.Value : 0);
+                    .FindPrices(id == null  ? id.Value : 0);
                 currentPrice = prices.Min();
             }

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Domain/CocktailService.cs:55:50
 
         public Cocktail ManualMix(IReadOnlyCollection<Ingridient> ingridients)
         {
-            var allowed = ingridients.Where(i => !i.IsAlcohol).ToList();
+            var allowed = ingridients.Where(i => i.IsAlcohol).ToList();
 
             int removedCount = ingridients.Count - allowed.Count;

[Survived] Binary expression mutation
Domain/CocktailService.cs:57:32
         {
             var allowed = ingridients.Where(i => !i.IsAlcohol).ToList();
 
-            int removedCount = ingridients.Count - allowed.Count;
+            int removedCount = ingridients.Count + allowed.Count;
 
             string name = $"Cocktail with {ingridients.First()}";

[Survived] String mutation
Domain/CocktailService.cs:59:27
 
             int removedCount = ingridients.Count - allowed.Count;
 
-            string name = $"Cocktail with {ingridients.First()}";
+            string name = $"";
 
             return new Cocktail();

[Killed] Void mutation
Domain/CocktailService.cs:67:13
         public Cocktail MixMilkShake(Ingridient milk, Ingridient vanillaIceCream)
         {
             var blender = new Blender();
-            blender.Add(milk);
+            ;
             blender.Add(vanillaIceCream);
             var blended = blender.Blend();

[Survived] Void mutation
Domain/CocktailService.cs:68:13
         {
             var blender = new Blender();
             blender.Add(milk);
-            blender.Add(vanillaIceCream);
+            ;
             var blended = blender.Blend();
             ThrowIfAlcohol(blended);

[Survived] Void mutation
Domain/CocktailService.cs:70:13
             blender.Add(milk);
             blender.Add(vanillaIceCream);
             var blended = blender.Blend();
-            ThrowIfAlcohol(blended);
+            ;
             return blended.ToCocktail("Milkshake");
         }
